Revit 2027 API
Form.ProfileCount Property
The number of profiles in the form.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ProfileCount { get; }
Public ReadOnly Property ProfileCount As Integer
	Get
public:
property int ProfileCount {
	int get ();
}
member ProfileCount : int with get
Property Value
Int32
See Also
Reference
Form Class
Autodesk.Revit.DB Namespace